---
id: py-sr-expression-eval
title: Вычисление выражения
difficulty: hard
language: python
---

# Описание

Вычислите значение арифметического выражения, содержащего целые числа, операторы +, -, *, / и круглые скобки. Деление целочисленное с усечением к нулю. Приоритет операций стандартный: скобки, затем * и /, затем + и -. На вход подаётся строка с выражением. Выведите целочисленный результат.

# Стартовый код

```python
def evaluate(expression):
    # ваш код
    pass

expression = input()
print(evaluate(expression))
```

# Тесты

```json
[
  {"stdin": "3+2*2", "expected": "7"},
  {"stdin": "(1+(4+5+2)-3)+(6+8)", "expected": "23"},
  {"stdin": "2*(5+5*2)/3+(6/2+8)", "expected": "21"},
  {"stdin": "1+1", "expected": "2"}
]
```
